      * CBLSTUD 

       01  STUDENT-MAST.
           05  STUDENT-ID              PIC X(6).
           05  STUDNET-LNAME           PIC X(20).
           05  STUDENT-FNAME           PIC X(20).
           05  STUDENT-INIT            PIC X.
           05  STUDENT-TERM-LAST-ATT   PIC XX.
           05  STUDENT-YEAR-LAST-ATT   PIC X(4).